{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 256, 256, 3], "padding": "valid", "activity_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 32}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "scale": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "center": true, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "scale": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "center": true, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 128, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "scale": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "center": true, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 512, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "scale": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "center": true, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 2, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1"}}