{"backend": "tensorflow", "config": {"layers": [{"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 256, 256, 3], "filters": 32, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "valid", "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "valid", "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "valid", "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_1", "bias_regularizer": null, "units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_2", "bias_regularizer": null, "units": 2, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}